CF/Documents/ВводОстатковРасчетовСПоставщиками.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Document>
		<Properties>
			<Name>ВводОстатковРасчетовСПоставщиками</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.РасчетыСПоставщиками</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Магазин</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Магазины</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РасчетыСПоставщиками</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Поставщик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументРасчета</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ВозвратТоваровПоставщику</v8:Type>
								<v8:Type>cfg:DocumentRef.ПоступлениеТоваров</v8:Type>
								<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КОплате</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КПоступлению</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

CF/Documents/ВводОстатковРасчетовСПоставщиками/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Инициализирует таблицы значений, содержащие данные документа.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ВводОстатковРасчетовСПоставщикамиРасчетыСПоставщиками.Ссылка.Магазин,
	|	ВводОстатковРасчетовСПоставщикамиРасчетыСПоставщиками.Ссылка.Дата КАК Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	ВводОстатковРасчетовСПоставщикамиРасчетыСПоставщиками.Поставщик,
	|	ВводОстатковРасчетовСПоставщикамиРасчетыСПоставщиками.ДокументРасчета,
	|	ВЫБОР
	|		КОГДА ВводОстатковРасчетовСПоставщикамиРасчетыСПоставщиками.Сумма > 0
	|			ТОГДА ВводОстатковРасчетовСПоставщикамиРасчетыСПоставщиками.Сумма
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Сумма,
	|	ВЫБОР
	|		КОГДА ВводОстатковРасчетовСПоставщикамиРасчетыСПоставщиками.КОплате > 0
	|			ТОГДА ВводОстатковРасчетовСПоставщикамиРасчетыСПоставщиками.КОплате
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КОплате,
	|	ВЫБОР
	|		КОГДА ВводОстатковРасчетовСПоставщикамиРасчетыСПоставщиками.КПоступлению > 0
	|			ТОГДА ВводОстатковРасчетовСПоставщикамиРасчетыСПоставщиками.КПоступлению
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КПоступлению
	|ИЗ
	|	Документ.ВводОстатковРасчетовСПоставщиками.РасчетыСПоставщиками КАК ВводОстатковРасчетовСПоставщикамиРасчетыСПоставщиками
	|ГДЕ
	|	ВводОстатковРасчетовСПоставщикамиРасчетыСПоставщиками.Ссылка = &Ссылка
	|	И (ВводОстатковРасчетовСПоставщикамиРасчетыСПоставщиками.Сумма > 0
	|			ИЛИ ВводОстатковРасчетовСПоставщикамиРасчетыСПоставщиками.КОплате > 0
	|			ИЛИ ВводОстатковРасчетовСПоставщикамиРасчетыСПоставщиками.КПоступлению > 0)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВводОстатковРасчетовСПоставщикамиРасчетыСПоставщиками.Ссылка.Магазин,
	|	ВводОстатковРасчетовСПоставщикамиРасчетыСПоставщиками.Ссылка.Дата,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
	|	ВводОстатковРасчетовСПоставщикамиРасчетыСПоставщиками.Поставщик,
	|	ВводОстатковРасчетовСПоставщикамиРасчетыСПоставщиками.ДокументРасчета,
	|	ВЫБОР
	|		КОГДА -ВводОстатковРасчетовСПоставщикамиРасчетыСПоставщиками.Сумма > 0
	|			ТОГДА -ВводОстатковРасчетовСПоставщикамиРасчетыСПоставщиками.Сумма
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА -ВводОстатковРасчетовСПоставщикамиРасчетыСПоставщиками.КОплате > 0
	|			ТОГДА -ВводОстатковРасчетовСПоставщикамиРасчетыСПоставщиками.КОплате
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА -ВводОстатковРасчетовСПоставщикамиРасчетыСПоставщиками.КПоступлению > 0
	|			ТОГДА -ВводОстатковРасчетовСПоставщикамиРасчетыСПоставщиками.КПоступлению
	|		ИНАЧЕ 0
	|	КОНЕЦ
	|ИЗ
	|	Документ.ВводОстатковРасчетовСПоставщиками.РасчетыСПоставщиками КАК ВводОстатковРасчетовСПоставщикамиРасчетыСПоставщиками
	|ГДЕ
	|	ВводОстатковРасчетовСПоставщикамиРасчетыСПоставщиками.Ссылка = &Ссылка
	|	И (-ВводОстатковРасчетовСПоставщикамиРасчетыСПоставщиками.Сумма > 0
	|			ИЛИ -ВводОстатковРасчетовСПоставщикамиРасчетыСПоставщиками.КОплате > 0
	|			ИЛИ -ВводОстатковРасчетовСПоставщикамиРасчетыСПоставщиками.КПоступлению > 0)");
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	
	Результат = Запрос.ВыполнитьПакет();
	
	ДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРасчетыСПоставщиками", Результат[0].Выгрузить());
	
КонецПроцедуры

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
